pranjalchanda08/MeshX/port/platform/esp/esp32c3/sdkconfig.defaults.esp32c3
# Override some defaults so BT stack is enabled
# by default in this example
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BT_CTRL_SCAN_DUPL_TYPE_DATA_DEVICE=y
CONFIG_BT_CTRL_BLE_MESH_SCAN_DUPL_EN=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
